---
kind: method
id: M:Autodesk.Revit.DB.Structure.MemberForcesServiceData.GetCurrentElements
source: html/f7440101-4db4-5db4-e6cb-8ef6520a7298.htm
---
# Autodesk.Revit.DB.Structure.MemberForcesServiceData.GetCurrentElements Method

Returns the list of Ids of the current elements.

## Syntax (C#)
```csharp
public IList<ElementId> GetCurrentElements()
```

## Returns
Ids of the current elements. Contains the family base element to which the Member Forces parameters belongs.